import json


with open('m.json') as f:
    sss = json.load(f)
    print(sss)
    print(json.dumps(sss, indent=4))


[
    {
        "a_ID": "編號",
        "b_作者": "作者名",
        "c_標題": "標題",
        "d_日期": "發文時間",
        "e_ip": "發文ip",
        "f_內文": "內文",
        "g_推文": {
            "推文編號": {
                "狀態": "推 or 噓 or →",
                "留言內容": "留言內容",
                "留言時間": "留言時間",
                "留言者": "留言者"
            },
            ...
        },
        "h_推文總數": {
            "all": "推文數目",
            "噓": "噓數",
            "推": "推數",
            "none": "→數"
        },
        "i_連結": "原始連結"
    },
    ......
]

差別在資料量的不同
根據每篇文章推文的總數量來做排序，多的在前面
